import { IData } from "@/types/types";

export const data: IData[] = [
    {
        labelText: "Глава I",
        startYear: "1900",
        endYear: "1940",
        info: [
            {
                title: "1900",
                description: "Начало XX века: новые направления в искусстве и науке.",
            },
            {
                title: "1910",
                description: "Появление первых автомобилей с бензиновыми двигателями и начало массового производства.",
            },
            {
                title: "1920",
                description: "Война и революции в Европе. Формирование новых государственных образований.",
            },
            {
                title: "1930",
                description: "Мировой экономический кризис: падение фондовых рынков и рост безработицы.",
            },
            {
                title: "1940",
                description: "Вторая мировая война: глобальные изменения и начало послевоенного восстановления.",
            }
        ]
    },
    {
        labelText: "Глава II",
        startYear: "1940",
        endYear: "1980",
        info: [
            {
                title: "1940",
                description: "Начало Второй мировой войны. Великобритания и Франция против Германии.",
            },
            {
                title: "1950",
                description: "Начало холодной войны между США и СССР.",
            },
            {
                title: "1960",
                description: "Космическая гонка: человек на Луне.",
            },
            {
                title: "1970",
                description: "Развитие массового производства и начало эргономики в индустрии.",
            },
            {
                title: "1980",
                description: "Появление компьютеров и начало информационной революции.",
            }
        ]
    },
    {
        labelText: "Кино",
        startYear: "1980",
        endYear: "1990",
        info: [
            {
                title: "1980",
                description: "Начало эры персональных компьютеров. Появление первых Macintosh от Apple.",
            },
            {
                title: "1983",
                description: "Создание Microsoft Windows, которое изменит рынок программного обеспечения.",
            },
            {
                title: "1985",
                description: "Появление первой игровой приставки Nintendo, начало эры консольных игр.",
            },
            {
                title: "1987",
                description: "Первый мобильный телефон Motorola, начало эры мобильной связи.",
            },
            {
                title: "1989",
                description: "Падение Берлинской стены, конец холодной войны.",
            }
        ],
    },
    {
        labelText: "Литература",
        startYear: "1990",
        endYear: "2000",
        info: [
            {
                title: "1990",
                description: "Нобелевская премия по литературе - Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах».",
            },
            {
                title: "1994",
                description: "«Бессонница» - роман Стивена Кинга.",
            },
            {
                title: "1995",
                description: "Нобелевская премия по литературе - Шеймас Хини.",
            },
            {
                title: "1997",
                description: "«Гарри Поттер и философский камень» - роман Джоан Роулинг.",
            },
            {
                title: "2000",
                description: "Возобновлено издание журнала «Театр».",
            }
        ],
    },
    {
        labelText: "Глава V",
        startYear: "2000",
        endYear: "2010", 
        info: [
            {
                title: "2000",
                description: "Возобновлено издание журнала «Театр».",
            },
            {
                title: "2002",
                description: "Премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон.",
            },
            {
                title: "2003",
                description: "В Венеции состоялся международный фестиваль современного театра.",
            },
            {
                title: "2005",
                description: "Появление первых блогов как массового явления.",
            },
            {
                title: "2007",
                description: "Выход iPhone, революция в мобильной связи и вычислениях.",
            },
        ],
    },
    {
        labelText: "Глава VI",
        startYear: "2010",
        endYear: "2020",
        info: [
            {
                title: "2010",
                description: "Старт облачных технологий и использование больших данных в бизнесе.",
            },
            {
                title: "2011",
                description: "Arab Spring — волна протестов и революций в арабских странах.",
            },
            {
                title: "2015",
                description: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
            },
            {
                title: "2016",
                description: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11.",
            },
            {
                title: "2020",
                description: "Пандемия COVID-19, глобальные изменения в мировой экономике и жизни.",
            },
        ],
    },
    {
        labelText: "Глава VII",
        startYear: "2020",
        endYear: "2030", 
        info: [
            {
                title: "2025",
                description: "Запуск первых коммерческих лунных экспедиций.",
            },
            {
                title: "2027",
                description: "Массовое внедрение автономных транспортных средств по всему миру.",
            },
            {
                title: "2029",
                description: "Революция в биотехнологиях: успешные операции по редактированию генома человека.",
            },
            {
                title: "2030",
                description: "Создание устойчивых экосистем в искусственных биосферах на Земле и Луне.",
            },
        ],
    },
    {
        labelText: "Глава VIII",
        startYear: "2030",
        endYear: "2040", 
        info: [
            {
                title: "2032",
                description: "Генерация энергии с использованием термоядерного синтеза.",
            },
            {
                title: "2035",
                description: "Роботизация большинства процессов в промышленности и обслуживании.",
            },
            {
                title: "2038",
                description: "Разработка полностью автономных мегаполисов.",
            },
        ],
    },
];
